---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamPorosity
source: html/0d305973-e08e-f3b4-1112-4b2277318f79.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamPorosity Property

"Porosity"

## Syntax (C#)
```csharp
public static ForgeTypeId ThermalMaterialParamPorosity { get; }
```